# Title

## Sub tiutle 

Some random text

In [20]:
import pandas as pd

# Load Excel file
df = pd.read_excel('Classeur1.xlsx')

In [21]:
df

   products   price
0  SNEAKERS    18876
1   BULIDNG     2454
2     HOUSE   334556
3    STUDIO      567
4      ROOM     5678

In [22]:
df['NewColumn'] = 'default value'

In [23]:
df

   products   price       NewColumn
0  SNEAKERS    18876  default value
1   BULIDNG     2454  default value
2     HOUSE   334556  default value
3    STUDIO      567  default value
4      ROOM     5678  default value

In [35]:
filtered_df = df[df['products '] == 'BULIDNG ']

In [36]:
filtered_df

  products   price       NewColumn
1  BULIDNG     2454  default value

In [37]:
df.to_excel('new.xlsx', index=False)